---
kind: property
id: P:Autodesk.Revit.DB.UnitTypeId.CurrencyPerWattHour
source: html/4432efbc-2143-a40b-c604-2dd661892f66.htm
---
# Autodesk.Revit.DB.UnitTypeId.CurrencyPerWattHour Property

Cost per watt hour.

## Syntax (C#)
```csharp
public static ForgeTypeId CurrencyPerWattHour { get; }
```